## Plan Result (stg-appgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw"
        name                              = "aks-fe-00-stg-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/c100-application" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "c100-application" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/pip-frontend" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "pip-frontend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/pip-frontend-b2c-sign-in" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "pip-frontend-b2c-sign-in" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/pip-frontend-b2c-staff" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "pip-frontend-b2c-staff" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/portal-stg" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "portal-stg" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/sds-api-mgmt" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "sds-api-mgmt" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-casetracker" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-casetracker" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-certificatedbailiffs" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-certificatedbailiffs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-courtfines" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-courtfines" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-immigrationappealsonline" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-immigrationappealsonline" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-admin-appeals" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-admin-appeals" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-care-standards" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-care-standards" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-cicap" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-cicap" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-employment-appeals" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-employment-appeals" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-finance-tax" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-finance-tax" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-immigration-svcs" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-immigration-svcs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-info-rights" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-info-rights" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-land-reg-division" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-land-reg-division" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-lands-chamber" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-lands-chamber" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/staging-trib-tansport-appeals" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "staging-trib-tansport-appeals" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/toffee" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "toffee" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/vh-admin-web" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "vh-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/vh-video-web" -> null
          - ip_addresses = [
              - "10.148.31.250",
            ] -> null
          - name         = "vh-video-web" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "c100-application"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "pip-frontend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "pip-frontend-b2c-sign-in"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "pip-frontend-b2c-staff"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "portal-stg"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "sds-api-mgmt"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-casetracker"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-certificatedbailiffs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-courtfines"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-immigrationappealsonline"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-admin-appeals"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-care-standards"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-cicap"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-employment-appeals"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-finance-tax"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-immigration-svcs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-info-rights"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-land-reg-division"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-lands-chamber"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "staging-trib-tansport-appeals"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "toffee"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "vh-admin-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "vh-video-web"
        }

        # (100 unchanged blocks hidden)
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":373,"Program":"tfcmt","SHA1":"","Target":"stg-appgateway","Vars":{}} -->